results/routeA/initialization_check/A-Ra1e3-fine/constant/hRef
FoamFile
{
    format ascii;
    class uniformDimensionedScalarField;
    location "constant";
    object hRef;
}
dimensions [0 1 0 0 0 0 0];
value 0;
