results/routeA/initialization_check/A-Ra1e3-fine/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
25600
(
-4.401408450704226e-05
-4.401408450704226e-05
-4.401408450704226e-05
-4.401408450704226e-05
-4.401408450704226e-05
-4.401408450704226e-05
-4.401408450704226e-05
-4.401408450704226e-05
...
)
;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-4.399207746478873e-05
-0.0001319762323943662
-0.0002199603873239437
-0.0003079445422535212
-0.0003959286971830986
-0.0004839128521126761
-0.0005718970070422535
-0.000659881161971831
...
)
;
    }
    coldWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-4.403609154929578e-05
-0.0001321082746478873
-0.0002201804577464789
-0.0003082526408450704
-0.000396324823943662
-0.0004843970070422535
-0.0005724691901408451
-0.0006605413732394366
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           uniform -0.01408450704225352;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
