results/routeA/initialization_check/A-Ra1e3-fine/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
25600
(
0
6.776263578034403e-21
6.776263578034403e-21
0
-6.776263578034403e-21
1.355252715606881e-20
2.032879073410321e-20
0
...
)
;

boundaryField
{
    hotWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
160
(
1.355252715606881e-20
2.710505431213761e-20
-5.421010862427522e-20
0
1.084202172485504e-19
5.421010862427522e-20
0
1.084202172485504e-19
...
)
;
    }
    coldWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
160
(
6.776263578034403e-21
2.710505431213761e-20
-5.421010862427522e-20
0
5.421010862427522e-20
5.421010862427522e-20
-1.084202172485504e-19
0
...
)
;
    }
    bottomWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    topWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
160
(
0
-3.469446951953614e-18
-3.469446951953614e-18
0
-3.469446951953614e-18
1.734723475976807e-18
1.734723475976807e-18
1.734723475976807e-18
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
