results/routeA/initialization_check/A-Ra1e3-fine/0/gh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      gh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
25600
(
-4.401408450704226e-05
-4.401408450704226e-05
-4.401408450704226e-05
-4.401408450704226e-05
-4.401408450704225e-05
-4.401408450704227e-05
-4.401408450704228e-05
-4.401408450704226e-05
...
)
;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-4.401408450704226e-05
-0.0001320422535211268
-0.0002200704225352112
-0.0003080985915492958
-0.0003961267605633804
-0.0004841549295774648
-0.0005721830985915493
-0.0006602112676056339
...
)
;
    }
    coldWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-4.401408450704226e-05
-0.0001320422535211268
-0.0002200704225352112
-0.0003080985915492958
-0.0003961267605633804
-0.0004841549295774648
-0.0005721830985915492
-0.0006602112676056338
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-0.01408450704225352
-0.01408450704225352
-0.01408450704225352
-0.01408450704225352
-0.01408450704225352
-0.01408450704225352
-0.01408450704225352
-0.01408450704225352
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
